[M_Ep12_BecomingJack MissionDefinition]
MissionName="This person must be Jack"
MissionDescription="If Jack wants to stop the soldiers from awakening, he must kill the Guardian Angel. everybody [place]Angel[-place] Protected against 3 major threats, 2 detected.<br>The last barrier to entering the angel's nest is a door that a good jack can open. Unfortunately, Tortoise doesn't know how to solve the last problem.."
TurnInDescription="Open the brake and pocket watch in one hand and press the other hand to your side. [place]to sew[-place], Everything is ready for use. [place]Angel guide for the family[-place] I then gave him the key to the room.."
MissionSummary="Gap's words."
MissionGiver="Roland"
MissionTurnInLocation="Roland"
TeaserText=""

[M_Ep12_BecomingJack:CollectVoiceSamples MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Ep12_BecomingJack:CollectVoiceSamples_Collection MissionObjectiveSetCollectionDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Ep12_BecomingJack:GetPocketwatch MissionObjectiveDefinition]
ProgressMessage="Collection time is two hours"

[M_Ep12_BecomingJack:GetVoiceSamples MissionObjectiveDefinition]
ProgressMessage="Find examples of languages"

[M_Ep12_BecomingJack:GetWatchSet MissionObjectiveSetDefinition]
MissionSummaryOverride="The Fair Jack pocket watch is double sided.."
MissionDescriptionOverride="If you want to prevent Hero Jack from waking up, you'll need to stop the Guardian Angel. welcome [place]Basic control of angels[-place] They were protected by three great barriers, but now there are two..<br>The final barrier to Angelo's hideout is a door that only handsome Jack can open..<br>The angel does not know how to open the door. He told him to kill one of the two cats. [place]I work[-place] The security guard collects the bags. In addition to the usual use of a pocket watch (such as telling the time or putting someone on a chain), Jack also plays a role. You have to open the door. [place]Basic control of angels[-place]s."

[M_Ep12_BecomingJack:GoToHyperionCity MissionObjectiveDefinition]
ProgressMessage="He went on vacation"

[M_Ep12_BecomingJack:GoToHyperionCitySet MissionObjectiveSetDefinition]
MissionSummaryOverride="Look back [place]May[-place]."
MissionDescriptionOverride="If you don't want to raise Jack as a soldier, you should find your own guardian angel. Alone [place]Basic angel control[-place] It was protected by three large barriers, two of which have been demolished..<br>The final obstacle in Angel's house is a door that only Magic Jack can open. The angels want you to enter the city [place]the opportunity[-place] Follow the instructions."

[M_Ep12_BecomingJack:KillDouble MissionObjectiveDefinition]
ProgressMessage="Double check"

[M_Ep12_BecomingJack:KillDoubleSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Killing Fairjack is a double whammy.."
MissionDescriptionOverride="If you don't want to wake up Jack Soldier you have to kill his guardian angel [place]Managing messages is easy[-place] The campaign focuses on three areas but has you covered.<br>The final barrier blocking entry to the Wild Gate is a door that only Handsome Jack can open..<br>The angel knows how to open the door, he wants you to kill the beautiful Jack."

[M_Ep12_BecomingJack:RetrievePassword MissionObjectiveDefinition]
ProgressMessage="Adjust the volume control"

[M_Ep12_BecomingJack:RetrievePasswordSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Get Jack's cute voice edit.."
MissionDescriptionOverride="If you want to stop the rise of Hero Jack, you must destroy the Guardian Angel. he [place]Check out Angel House.[-place] It is protected by three major obstacles, but has already solved two of them..<br>The last obstacle in the Angel's room is a door that can only be opened by Handsome Jack..<br>Angel buys a pocket watch for a cute character and explains that the product is not good. In addition to the common uses of pocket watches, such as telling time or tracking someone with a chain, there are also jack pocket watches..<br>However, this was not enough to overcome the last obstacle. The door to Jack's Bible study is open, but it won't open until Jack uses his voice to say the password..<br>Malaika made a mod that turns your voice into a speaker. Just getting it.."

[M_Ep12_BecomingJack:UploadSamples MissionObjectiveDefinition]
ProgressMessage="Send sample to Angel"

[M_Ep12_BecomingJack:UploadSamplesSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Submit your Jack the Angel vocal sample.."
MissionDescriptionOverride="If you want to prevent Jack from getting a hero, you need to cancel the guardian angel. this [place]Guided by a heavenly angel[-place] It is protected from three main obstacles, but both must be taken care of..<br>The last obstacle on the angel's floor is a door that can only be opened by handsome Jack..<br>After removing a pocket watch from one of Jack's phones, Angel tells her friend that all is not as it seems. In addition to the usual uses of a pocket watch (watch, chain, etc.), there are also traces of Jack's biology..<br>However, this was not enough to overcome the last hurdle. Although the door recognizes Jack's biometrics, it won't open without a password spoken by his voice..<br>Now that you have enough samples of Jack's voice, Angel wants you to build a unit that will send data to your pocket watch so that your voice becomes Jack's voice.."

[M_Ep12_BecomingJack:UseFirstKiosk MissionObjectiveDefinition]
ProgressMessage="Use the information desk"

[M_Ep12_BecomingJack:UseFirstKioskSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Let's use Jack's voice to create a voice modulator.."
MissionDescriptionOverride="If you want to stop Jack from awakening the hero, you must destroy the guardian angel. What [place]Control the angel Tslymax[-place] It is protected by three main barriers, two of which I have already mentioned..<br>The final obstacle to the angel gate is a door that only the handsome Jack can open..<br>Angel takes the pocket watch from the handsome Jack and informs him that the artifact is not what it seems. In addition to its usual uses (weather reporting, tending to chained people, etc.), Jack's memoir also has characteristics..<br>However, this is not enough to overcome the final hurdle; Even though the door recognizes Jack's fingerprint, it won't open until he says the password with his voice..<br>The angel instructs you to use your pocket watch and print copies of Jack's poem on scattered bulletin boards. [place]possibility[-place]. When you have enough of them, Angel will use them to create a modulator that makes your voice sound like Jack.."

